# TechNest Assignment 3

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

# Q1. Write an SQL query to fetch the student details for the below conditions.
***All these conditions are sub questions so your query must be seperate for each of the sub questions mentioned below.<br>
a)Those who have scored 90 in Phy<br>
b)Those who have scored 90 in Che<br>
c)Those who have scored 90 in Phy or Che***<br>
<br>
***Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);<br>
insert into student values(1,'A','Phy','90');<br>
insert into student values(1,'A','Che','90');<br>
insert into student values(2,'B','Phy','80');<br>
insert into student values(2,'B','Che','85');<br>
insert into student values(3,'C','Phy','90');<br>
insert into student values(4,'D','Phy','75');<br>
insert into student values(4,'D','Che','90');***

In [4]:
%sql Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);insert into student values(1,'A','Phy','90');insert into student values(1,'A','Che','90');insert into student values(2,'B','Phy','80');insert into student values(2,'B','Che','85');insert into student values(3,'C','Phy','90');insert into student values(4,'D','Phy','75');insert into student values(4,'D','Che','90');

%sql select * from student;

 * sqlite://
Done.

[(1, 'A', 'Phy', 90),
 (1, 'A', 'Che', 90),
 (2, 'B', 'Phy', 80),
 (2, 'B', 'Che', 85),
 (3, 'C', 'Phy', 90),
 (4, 'D', 'Phy', 75),
 (4, 'D', 'Che', 90)]

In [5]:
#### solution
#### (a)
%sql select * from student where marks = '90' and subject = 'Phy';

 * sqlite://
Done.

[(1, 'A', 'Phy', 90), (3, 'C', 'Phy', 90)]

In [6]:
#### (b)
%sql select * from student where marks = '90' and subject = 'Che';

 * sqlite://
Done.

[(1, 'A', 'Che', 90), (4, 'D', 'Che', 90)]

In [7]:
#### (c)
%sql select * from student where marks = '90' and subject in ('Phy','Che');

 * sqlite://
Done.

[(1, 'A', 'Phy', 90),
 (1, 'A', 'Che', 90),
 (3, 'C', 'Phy', 90),
 (4, 'D', 'Che', 90)]

In [8]:
%sql drop table student;

 * sqlite://
Done.

[]

# Q2. Write a SQL query to fetch the employee details with empid 1 or 2 or 8 using IN operator.
***Create table employee(empid number,empname varchar2(10),Mgrid number);
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E','');<br>
insert into employee values(6,'F','');***

In [9]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number); insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E','');insert into employee values(6,'F','');
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', ''),
 (6, 'F', '')]

In [10]:
# solution
%sql select * from employee where empid in ('1','2','8');

 * sqlite://
Done.

[(1, 'A', 4), (2, 'B', 5)]

In [65]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q3.Write a SQL query to fetch distinct 
***a) empid<br>
b) empname<br>
c) dept<br>
d) empid,empname<br>
e) empname,dept***<br>
<br>
***Create table Dept(Empid number,Empname varchar2(10),Dept varchar2(10));<br>
insert into dept values(1,'A','HR');<br>
insert into dept values(2,'B','HR');<br>
insert into dept values(3,'C','SALES');<br>
insert into dept values(4,'D','SALES');<br>
insert into dept values(5,'E','SALES');<br>
insert into dept values(6,'F',NULL);<br>
insert into dept values(7,'G',NULL);<br>
insert into dept values(1,'A','HR');<br>
insert into dept values(2,'B','HR');<br>
insert into dept values(3,'C','SALES');***

In [12]:
%sql Create table Dept(Empid number,Empname varchar2(10),Dept varchar2(10));insert into dept values(1,'A','HR');insert into dept values(2,'B','HR');insert into dept values(3,'C','SALES');insert into dept values(4,'D','SALES');insert into dept values(5,'E','SALES');insert into dept values(6,'F',NULL);insert into dept values(7,'G',NULL);insert into dept values(1,'A','HR');insert into dept values(2,'B','HR');insert into dept values(3,'C','SALES');
%sql select * from dept;

 * sqlite://
Done.

[(1, 'A', 'HR'),
 (2, 'B', 'HR'),
 (3, 'C', 'SALES'),
 (4, 'D', 'SALES'),
 (5, 'E', 'SALES'),
 (6, 'F', None),
 (7, 'G', None),
 (1, 'A', 'HR'),
 (2, 'B', 'HR'),
 (3, 'C', 'SALES')]

In [13]:
# solution

# (a)
%sql select distinct empid from dept;

 * sqlite://
Done.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,)]

In [14]:
# (b)
%sql select distinct empname from dept;

 * sqlite://
Done.

[('A',), ('B',), ('C',), ('D',), ('E',), ('F',), ('G',)]

In [15]:
# (c)
%sql select distinct dept from dept;

 * sqlite://
Done.

[('HR',), ('SALES',), (None,)]

In [16]:
# (d)
%sql select distinct empid,empname from dept;

 * sqlite://
Done.

[(1, 'A'), (2, 'B'), (3, 'C'), (4, 'D'), (5, 'E'), (6, 'F'), (7, 'G')]

In [17]:
# (e)
%sql select distinct empname,dept from dept;

 * sqlite://
Done.

[('A', 'HR'),
 ('B', 'HR'),
 ('C', 'SALES'),
 ('D', 'SALES'),
 ('E', 'SALES'),
 ('F', None),
 ('G', None)]

In [19]:
%sql drop table dept;

 * sqlite://
Done.

[]

# Q4. Write a SQL query to fetch the records where 
***a>ID is null<br>
b>NAME is null<br>
c>ID is not null<br>
d>NAME is not null<br>
e>ID and NAME both are null<br>
f>Either ID is null or NAME is null.<br>
g>total count of null records in ID column.<br>
h>total count of null records in NAME column.<br>
i>total count of records were ID and NAME both are null.<br>
j>display the distinct IDs<br>
k>display the distinct NAME***<br>
<br>
***CREATE TABLE STUD1(ID NUMBER,NAME VARCHAR2(10));<br>
INSERT INTO STUD1 VALUES(NULL,'A');<br>
INSERT INTO STUD1 VALUES(1,NULL);<br>
INSERT INTO STUD1 VALUES(NULL,NULL);***

In [18]:
%sql CREATE TABLE STUD1(ID NUMBER,NAME VARCHAR2(10));INSERT INTO STUD1 VALUES(NULL,'A');INSERT INTO STUD1 VALUES(1,NULL);INSERT INTO STUD1 VALUES(NULL,NULL);
%sql select * from stud1;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(None, 'A'), (1, None), (None, None)]

In [21]:
# solution

# (a)
%sql select * from stud1 where id is null;

 * sqlite://
Done.

[(None, 'A'), (None, None)]

In [25]:
# (b)
%sql select * from stud1 where name is null;

 * sqlite://
Done.

[(1, None), (None, None)]

In [23]:
# (c)
%sql select * from stud1 where id is not null;

 * sqlite://
Done.

[(1, None)]

In [26]:
# (d)
%sql select * from stud1 where name is not null;

 * sqlite://
Done.

[(None, 'A')]

In [27]:
# (e)
%sql select * from stud1 where id is null and name is null;

 * sqlite://
Done.

[(None, None)]

In [28]:
# (f)
%sql select * from stud1 where id is null or name is null;

 * sqlite://
Done.

[(None, 'A'), (1, None), (None, None)]

In [30]:
# (g)
%sql select count(*) from stud1 where id is null;

 * sqlite://
Done.

[(2,)]

In [32]:
# (h)
%sql select count(*) from stud1 where name is null;

 * sqlite://
Done.

[(2,)]

In [33]:
# (i)
%sql select count(*) from stud1 where id is null and name is null;

 * sqlite://
Done.

[(1,)]

In [38]:
# (j)
%sql select distinct id from stud1;

 * sqlite://
Done.

[(None,), (1,)]

In [39]:
# (k)
%sql select distinct name from stud1;

 * sqlite://
Done.

[('A',), (None,)]

# Q5. Write an SQL query to fetch the records which have atleast one yellow present in any of the columns(c1,c2 or c3)
***create table practice(id int,c1 varchar(50),c2 varchar(50),c3 varchar(50));<br>
insert into practice values(1,'red','yellow','blue');<br>
insert into practice values(2,null,'red','green');<br>
insert into practice values(3,'yellow',null,'violet');***

In [47]:
%sql create table practice(id int,c1 varchar(50),c2 varchar(50),c3 varchar(50));insert into practice values(1,'red','yellow','blue');insert into practice values(2,null,'red','green');insert into practice values(3,'yellow',null,'violet');

%sql select * from practice;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'red', 'yellow', 'blue'),
 (2, None, 'red', 'green'),
 (3, 'yellow', None, 'violet')]

In [50]:
# solution
%sql select * from practice where c1 = 'yellow' or c2 = 'yellow' or c3 = 'yellow';

 * sqlite://
Done.

[(1, 'red', 'yellow', 'blue'), (3, 'yellow', None, 'violet')]

In [51]:
%sql drop table practice;

 * sqlite://
Done.

[]

# Q6.Write a SQL query to fetch the records where salary is NULL and is from SALES DEPT.
***create table dept (dept_id number,deptname varchar2(10),empname varchar2(10),salary number);<br>
insert into dept values(1,'HR','A',100);<br>
insert into dept values(1,'HR','B',200);<br>
insert into dept values(1,'HR','C',300);<br>
insert into dept values(1,'HR','X',NULL);<br>
insert into dept values(2,'SALES','D',400);<br>
insert into dept values(2,'SALES','E',500);<br>
insert into dept values(2,'SALES','F',600);<br>
insert into dept values(2,'SALES','Y',NULL);<br>
insert into dept values(3,'TECH','G',700);<br>
insert into dept values(3,'TECH','H',800);<br>
insert into dept values(3,'TECH','I',900);<br>
insert into dept values(3,'TECH','Z',NULL);***<br>
<br>
O/P:<br>
id  c1     c2       c3<br>
1  red     yellow   blue<br>
3  yellow  null     violet<br>

In [52]:
%sql create table dept (dept_id number,deptname varchar2(10),empname varchar2(10),salary number);insert into dept values(1,'HR','A',100);insert into dept values(1,'HR','B',200);insert into dept values(1,'HR','C',300);insert into dept values(1,'HR','X',NULL);insert into dept values(2,'SALES','D',400);insert into dept values(2,'SALES','E',500);insert into dept values(2,'SALES','F',600);insert into dept values(2,'SALES','Y',NULL);insert into dept values(3,'TECH','G',700);insert into dept values(3,'TECH','H',800);insert into dept values(3,'TECH','I',900);insert into dept values(3,'TECH','Z',NULL);
%sql select * from dept;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'HR', 'A', 100),
 (1, 'HR', 'B', 200),
 (1, 'HR', 'C', 300),
 (1, 'HR', 'X', None),
 (2, 'SALES', 'D', 400),
 (2, 'SALES', 'E', 500),
 (2, 'SALES', 'F', 600),
 (2, 'SALES', 'Y', None),
 (3, 'TECH', 'G', 700),
 (3, 'TECH', 'H', 800),
 (3, 'TECH', 'I', 900),
 (3, 'TECH', 'Z', None)]

In [54]:
# solution
%sql select * from dept where deptname = 'SALES' and salary is null;

 * sqlite://
Done.

[(2, 'SALES', 'Y', None)]

In [57]:
%sql drop table dept;

 * sqlite://
Done.

[]

# Q7.Write a SQL query to fetch the records
<br>

***a)Employees who are working in HR dept<br>
b)Employees who are working in HR or SALES dept<br>
c)Employees who are working in Tech Dept and earning salary 900<br>***

***create table dept (dept_id int,deptname varchar(10),empname varchar(10),salary int);<br>
insert into dept values(1,'HR','A',100);<br>
insert into dept values(1,'HR','B',200);<br>
insert into dept values(1,'HR','C',300);<br>
insert into dept values(1,'HR','X',NULL);<br>
insert into dept values(2,'SALES','D',400);<br>
insert into dept values(2,'SALES','E',500);<br>
insert into dept values(2,'SALES','F',600);<br>
insert into dept values(2,'SALES','Y',NULL);<br>
insert into dept values(3,'TECH','G',700);<br>
insert into dept values(3,'TECH','H',800);<br>
insert into dept values(3,'TECH','I',900);<br>
insert into dept values(3,'TECH','Z',NULL);***

In [59]:
%sql create table dept (dept_id int,deptname varchar(10),empname varchar(10),salary int);insert into dept values(1,'HR','A',100);insert into dept values(1,'HR','B',200);insert into dept values(1,'HR','C',300);insert into dept values(1,'HR','X',NULL);insert into dept values(2,'SALES','D',400);insert into dept values(2,'SALES','E',500);insert into dept values(2,'SALES','F',600);insert into dept values(2,'SALES','Y',NULL);insert into dept values(3,'TECH','G',700);insert into dept values(3,'TECH','H',800);insert into dept values(3,'TECH','I',900);insert into dept values(3,'TECH','Z',NULL);
%sql select * from dept;

 * sqlite://
Done.

[(1, 'HR', 'A', 100),
 (1, 'HR', 'B', 200),
 (1, 'HR', 'C', 300),
 (1, 'HR', 'X', None),
 (2, 'SALES', 'D', 400),
 (2, 'SALES', 'E', 500),
 (2, 'SALES', 'F', 600),
 (2, 'SALES', 'Y', None),
 (3, 'TECH', 'G', 700),
 (3, 'TECH', 'H', 800),
 (3, 'TECH', 'I', 900),
 (3, 'TECH', 'Z', None)]

In [60]:
# solution
# (a)
%sql select * from dept where deptname = 'HR';

 * sqlite://
Done.

[(1, 'HR', 'A', 100),
 (1, 'HR', 'B', 200),
 (1, 'HR', 'C', 300),
 (1, 'HR', 'X', None)]

In [61]:
# (b)
%sql select * from dept where deptname in ('HR','SALES');

 * sqlite://
Done.

[(1, 'HR', 'A', 100),
 (1, 'HR', 'B', 200),
 (1, 'HR', 'C', 300),
 (1, 'HR', 'X', None),
 (2, 'SALES', 'D', 400),
 (2, 'SALES', 'E', 500),
 (2, 'SALES', 'F', 600),
 (2, 'SALES', 'Y', None)]

In [62]:
# (c)
%sql select * from dept where deptname = 'TECH' and salary ='900';

 * sqlite://
Done.

[(3, 'TECH', 'I', 900)]

In [64]:
%sql drop table dept;

 * sqlite://
Done.

[]

# Q8. Write a SQL query to fetch the employee details whose name is 'A' OR  empid is 2.

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E','');<br>
insert into employee values(6,'F','');***

In [66]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E','');insert into employee values(6,'F','');
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', ''),
 (6, 'F', '')]

In [68]:
# solution
%sql select * from employee where empname = 'A' or empid = '2';

 * sqlite://
Done.

[(1, 'A', 4), (2, 'B', 5)]

In [69]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q9. Write an SQL query to fetch those employee names whose salary is 600 and is either from 'HR' or 'TECH' dept.

***create table emp(id number,name varchar2(10),dept varchar2(10),salary number);<br>
insert into emp values(1,'A','HR',100);<br>
insert into emp values(2,'B','HR',600);<br>
insert into emp values(3,'C','HR',600);<br>
insert into emp values(4,'D','HR',500);<br>
insert into emp values(5,'H','TECH',300);<br>
insert into emp values(6,'E','TECH',200);<br>
insert into emp values(7,'F','TECH',600);<br>
insert into emp values(8,'G','TECH',600);<br>
insert into emp values(9,'H','SALES',300);<br>
insert into emp values(10,'I','SALES',400);<br>
insert into emp values(11,'J','SALES',600);<br>
insert into emp values(12,'K','SALES',600);***

In [70]:
%sql create table emp(id number,name varchar2(10),dept varchar2(10),salary number);insert into emp values(1,'A','HR',100);insert into emp values(2,'B','HR',600);insert into emp values(3,'C','HR',600);insert into emp values(4,'D','HR',500);insert into emp values(5,'H','TECH',300);insert into emp values(6,'E','TECH',200);insert into emp values(7,'F','TECH',600);insert into emp values(8,'G','TECH',600);insert into emp values(9,'H','SALES',300);insert into emp values(10,'I','SALES',400);insert into emp values(11,'J','SALES',600);insert into emp values(12,'K','SALES',600);
%sql select * from emp;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'HR', 100),
 (2, 'B', 'HR', 600),
 (3, 'C', 'HR', 600),
 (4, 'D', 'HR', 500),
 (5, 'H', 'TECH', 300),
 (6, 'E', 'TECH', 200),
 (7, 'F', 'TECH', 600),
 (8, 'G', 'TECH', 600),
 (9, 'H', 'SALES', 300),
 (10, 'I', 'SALES', 400),
 (11, 'J', 'SALES', 600),
 (12, 'K', 'SALES', 600)]

In [71]:
# solution
%sql select name from emp where salary = '600' and dept in ('HR','TECH');

 * sqlite://
Done.

[('B',), ('C',), ('F',), ('G',)]

In [72]:
%sql drop table emp;

 * sqlite://
Done.

[]

# Q10. Write a SQL query to fetch the student details who have scored 90 in Che

***Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);<br>
insert into student values(1,'A','Phy','90');<br>
insert into student values(1,'A','Che','95');<br>
insert into student values(2,'B','Phy','80');<br>
insert into student values(2,'B','Che','85');<br>
insert into student values(3,'C','Phy','90');<br>
insert into student values(4,'D','Phy','75');<br>
insert into student values(4,'D','Che','90');***

In [73]:
%sql Create table Student(Studid number,NAME varchar2(10),Subject varchar2(20),marks number);insert into student values(1,'A','Phy','90');insert into student values(1,'A','Che','95');insert into student values(2,'B','Phy','80');insert into student values(2,'B','Che','85');insert into student values(3,'C','Phy','90');insert into student values(4,'D','Phy','75');insert into student values(4,'D','Che','90');
%sql select * from student;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 'Phy', 90),
 (1, 'A', 'Che', 95),
 (2, 'B', 'Phy', 80),
 (2, 'B', 'Che', 85),
 (3, 'C', 'Phy', 90),
 (4, 'D', 'Phy', 75),
 (4, 'D', 'Che', 90)]

In [74]:
# solution
%sql select * from student where marks = '90' and subject = 'Che';

 * sqlite://
Done.

[(4, 'D', 'Che', 90)]

In [89]:
%sql drop table student;

 * sqlite://
Done.

[]

# Q11. Write a SQL query to fetch the employee details with empid 1 or 2 or 8.

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E',null);<br>
insert into employee values(6,'F',null);***

In [75]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E',null);insert into employee values(6,'F',null);
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', None),
 (6, 'F', None)]

In [76]:
# solution

%sql select * from employee where empid in ('1','2','8');

 * sqlite://
Done.

[(1, 'A', 4), (2, 'B', 5)]

In [77]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q12. Write a SQL query to fetch the employee details whose name is 'A' OR  empid is 2.

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E','');<br>
insert into employee values(6,'F','');***

In [78]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E','');insert into employee values(6,'F','');
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', ''),
 (6, 'F', '')]

In [79]:
# solution
%sql select * from employee where empname = 'A' or  empid = '2';

 * sqlite://
Done.

[(1, 'A', 4), (2, 'B', 5)]

In [81]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q13. Write a SQL query to fetch the employee details who are working under mgrid= 5;

***Create table employee(empid number,empname varchar2(10),Mgrid number);<br>
insert into employee values(1,'A',4);<br>
insert into employee values(2,'B',5);<br>
insert into employee values(3,'C',6);<br>
insert into employee values(4,'D',5);<br>
insert into employee values(5,'E','');<br>
insert into employee values(6,'F','');***

In [82]:
%sql Create table employee(empid number,empname varchar2(10),Mgrid number);insert into employee values(1,'A',4);insert into employee values(2,'B',5);insert into employee values(3,'C',6);insert into employee values(4,'D',5);insert into employee values(5,'E','');insert into employee values(6,'F','');
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 4),
 (2, 'B', 5),
 (3, 'C', 6),
 (4, 'D', 5),
 (5, 'E', ''),
 (6, 'F', '')]

In [84]:
# solution
%sql select * from employee where mgrid = '5';

 * sqlite://
Done.

[(2, 'B', 5), (4, 'D', 5)]

In [85]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q14.Write a Query to fetch the empname whose salary is Rs.100

***Create table employee(empid number,empname varchar2(10),salary number);<br>
insert into employee values(1,'A',100);<br>
insert into employee values(2,'B',200);<br>
insert into employee values(3,'C',100);<br>
insert into employee values(4,'D',300);<br>
insert into employee values(5,'E',100);<br>
insert into employee values(6,'F',400);***

In [86]:
%sql Create table employee(empid number,empname varchar2(10),salary number);insert into employee values(1,'A',100);insert into employee values(2,'B',200);insert into employee values(3,'C',100);insert into employee values(4,'D',300);insert into employee values(5,'E',100);insert into employee values(6,'F',400);
%sql select * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(1, 'A', 100),
 (2, 'B', 200),
 (3, 'C', 100),
 (4, 'D', 300),
 (5, 'E', 100),
 (6, 'F', 400)]

In [87]:
# solution
%sql select empname from employee where salary = '100';

 * sqlite://
Done.

[('A',), ('C',), ('E',)]

In [88]:
%sql drop table employee;

 * sqlite://
Done.

[]